<HTML>
<HEAD>
<TITLE>Afrikan t&auml;hti - s&auml;&auml;nn&ouml;t</TITLE>
</HEAD>
<BODY BACKGROUND="/star_of_Africa/docs/background.png">
<CENTER><H1>Pelin s&auml;&auml;nn&ouml;t</H1></CENTER>

<H2>1. Esipuhe</H2>
<P>T&auml;m&auml; peli on tietokonesovitus klassisesta suomalaisesta lautapelist&auml;, jonka
alunperin loi Kari Mannerla. Alkuper&auml;isen pelin mukana seuranneet s&auml;&auml;nn&ouml;t
olivat lyhyet ja yksinkertaiset - niin yksinkertaiset ett&auml; j&auml;ttiv&auml;t v&auml;lill&auml;
tulkinnan varaa. Esim. ne eiv&auml;t ottaneet kantaa siihen saako pelaaja vaihtaa
&quot;lennossa&quot; merireitilt&auml; maareitille, tai p&auml;invastoin. T&auml;st&auml; syyst&auml;
peli&auml; on pelattu lukuisilla pienill&auml; variaatioilla suomalaisten kodeissa
vuosikymmenien ajan. Pelaajat ovat yksinkertaisesti sopineet s&auml;&auml;nt&ouml;jen
yksityiskohdista ennen pelin alkua (tai sen aikana). T&auml;llainen tarkkuuden
puute ei tietenk&auml;&auml;n ole hyv&auml;ksytt&auml;v&auml; tietokonepeli&auml; tehdess&auml;, ja t&auml;st&auml; syyst&auml;
pelaajaa kehotetaan lukemaan <I>n&auml;it&auml;</I> s&auml;&auml;nt&ouml;j&auml; l&auml;pi, vaikka peli olisikin
h&auml;nelle tuttu.</P>

<P>On my&ouml;s maininnan arvoinen asia ett&auml; vuonna 2005 virallisiin s&auml;&auml;nt&ouml;ihin
tuli lis&auml;ys joka sallii rahattoman pelaajan matkustamisen merireitill&auml; siten
ett&auml;, h&auml;n saa liikkua 2 askelta per vuoro heitt&auml;m&auml;tt&auml; noppaa. T&auml;m&auml; peli
kuitenkin noudattaa perinteisi&auml; s&auml;&auml;nt&ouml;j&auml;, miss&auml; t&auml;t&auml; ei sallita. Tulevaisuudessa
ilmestyy ehk&auml; versio joka sallii s&auml;&auml;nt&ouml;jen valitsemisen, mutta t&auml;ll&auml; hetkell&auml;
vanhat s&auml;&auml;nn&ouml;t p&auml;tev&auml;t.</P>

<H2>2. Yleinen asetelma</H2>
<P>Afrikan t&auml;hti on lautapeli 2-5:lle pelaajalle, josta v&auml;hint&auml;&auml;n yksi on
ihminen. Muut pelaajat voivat olla ihmisi&auml;, tai tietokoneen ohjaamia. Peli
katsotaan olevan sopiva 4-vuotiaille ja yl&ouml;sp&auml;in. Lauta koostuu Afrikan
kartasta jossa eri paikat ovat yhdistetty maa-, meri-, ja ilma-teitse. Kartalla
on 30 paikkaa (kaupunkia) jonka p&auml;&auml;ll&auml; on pelin alussa pelimerkki. N&auml;m&auml;
pelimerkit ovat pelaajien ker&auml;tt&auml;viss&auml;. Merkit sekoitetaan ja asetetaan
kaupunkien p&auml;&auml;lle - yksi per kaupunki - ennen pelin alkua. (Tietokone tekee t&auml;m&auml;n
automaattisesti.)</P>
<P>Ennen pelin alkua pelaajan on p&auml;&auml;tett&auml;v&auml; aloittaako h&auml;n pelin
Tangieriss&auml; vai Cairossa (jotka on merkattu isoilla punaisilla ympyr&ouml;ill&auml; laudalla).
Pelin p&auml;&auml;m&auml;&auml;r&auml; on l&ouml;yt&auml;&auml; pelimerkki jossa on Afrikan t&auml;hti, ja palata t&auml;m&auml;n kanssa jompaan kumpaan
aloituspisteeseen. Alkuper&auml;isversiossa pelaajien aloitusj&auml;rjestys ratkaistiin
noppaa heitt&auml;m&auml;ll&auml;. T&auml;ss&auml; versiossa j&auml;rjestyksen arpoo automaattisesti
tietokone.</P>

<H2>3. Siirt&auml;minen</H2>
<H3>3.1. Siirt&auml;minen maalla</H3>
<P>Pelaaja voi siirty&auml; maareittej&auml; pitkin heitt&auml;m&auml;ll&auml; noppa, ja siirt&auml;m&auml;ll&auml;
se askelm&auml;&auml;r&auml; jonka nopan luku m&auml;&auml;r&auml;&auml;. Jos pelaajan reitille osuu kaupunki, niin
h&auml;n saa, jos niin haluaa, j&auml;&auml;d&auml; siihen vaikka nopan silm&auml;luku veisikin
pidemm&auml;lle.</P>

<H3>3.2. Siirt&auml;minen merell&auml;</H3>
<P>Pelaaja saa siirt&auml;&auml; merireittej&auml; pitkin kunhan maksaa ensin lipun hinnan
&pound;100, joka on aina sama merireitin pituudesta huolimatta. T&auml;m&auml;n j&auml;lkeen
h&auml;n saa heitt&auml;&auml; noppaa ja siirty&auml; se m&auml;&auml;r&auml; askeleita sinisi&auml; merireittiruutuja
pitkin jonka noppa m&auml;&auml;r&auml;&auml;. Kun h&auml;n on laivalle astunut h&auml;nen m&auml;&auml;r&auml;np&auml;&auml;ns&auml; on
se mink&auml; h&auml;n silloin m&auml;&auml;r&auml;si, eik&auml; h&auml;n pysty t&auml;t&auml; muuttamaan, vaikka reitti
jakautuisikin tavalla joka tekisi p&auml;&auml;m&auml;&auml;r&auml;n muutoksen mahdolliseksi jos kyseess&auml;
olisi maareitti. (H&auml;nh&auml;n on lopulta vain matkustaja laivalla, eik&auml; laiva
reitti&auml;&auml;n muuta vain sen takia ett&auml; matkustaja on muuttanut mielt&auml;&auml;n.)</P>
<P>Sek&auml; laivaan nouseminen, ett&auml; siit&auml; poistuminen vie omaa aikaansa, eik&auml;
pelaaja t&auml;m&auml;n t&auml;hden voi &quot;lennossa&quot; vaihtaa merireitilt&auml; maareitille
tai p&auml;invastoin.</P>

<H3>3.3. Lent&auml;minen</H3>
<P>Pelaaja voi siirty&auml; ilmareittej&auml; (punaisia, kahta kaupunkia yhdist&auml;vi&auml;
viivoja) pitkin maksamalla lipun hinnan &pound;300, ja siirt&auml;m&auml;ll&auml;
pelinappulaansa suoraan m&auml;&auml;r&auml;np&auml;&auml;h&auml;n heitt&auml;m&auml;tt&auml; noppaa. Aivan kuten laivan
lipun kanssa, niin hinta on vakio, riippumatta reitin pituudesta.</P>

<H2>4. Pelimerkit</H2>
<H3>4.1. Pelimerkin avaaminen</H3>
<P>Pelaaja voi avata pelimerkin jonka p&auml;&auml;ll&auml; seisoo, joko maksamalla 100 puntaa
tai - jos h&auml;nelt&auml; ovat rahat loppuneet, tai h&auml;n ei jostain syyst&auml; halua k&auml;ytt&auml;&auml;
rahojaan - heitt&auml;m&auml;ll&auml; noppaa ja saamalla 4 tai suurempi luku. Nopanheitto joka
k&auml;ytet&auml;&auml;n merkin k&auml;&auml;nt&auml;miseen ei voida k&auml;ytt&auml;&auml; siirtymiseen, riippumatta siit&auml;
onnistuiko k&auml;&auml;nt&ouml; vai ei. T&auml;st&auml; syyst&auml; aikomus heitt&auml;&auml; k&auml;&auml;nt&auml;mist&auml; varten on
ilmaistava ennen nopan heittoa.</P>
<P>Pelaaja saa ostaa merkin heti paikalle saavuttuaan edellytt&auml;en ett&auml;, h&auml;nell&auml;
on riitt&auml;v&auml;t varat tehd&auml; n&auml;in. Mik&auml;li h&auml;n haluaa avata merkin noppaa heitt&auml;m&auml;ll&auml;
h&auml;nen on odotettava seuraavaa vuoroa.</P>

<H3>4.2. Pelimerkkityyppej&auml;</H3>
<P>On olemassa 7 eri pelimerkki&auml;, jokaisella oma merkityksens&auml;:</P>
<TABLE BORDER="1">
<TR><TD><B>Pelimerkki</B></TD><TD><B>Pelimerkkien m&auml;&auml;r&auml;</B></TD><TD><B>Tapahtuma</B></TD></TR>
<TR><TD>Tyhj&auml;</TD><TD>12</TD><TD>Mit&auml;&auml;n ei tapahdu.</TD></TR>
<TR><TD>Hevosenkenk&auml;</TD><TD>5</TD><TD>Ennen t&auml;hden l&ouml;yt&auml;mist&auml; mit&auml;&auml;n<BR>ei tapahdu. L&ouml;yt&auml;misen j&auml;lkeen<BR>se toimii t&auml;hden korvikkeena.</TD></TR>
<TR><TD>Rosvo</TD><TD>3</TD><TD>Pelaaja menett&auml;&auml; kaikki rahansa.</TD></TR>
<TR><TD>Topaasi (Keltainen jalokivi)</TD><TD>4</TD><TD>Pelaaja saa &pound;300.</TD></TR>
<TR><TD>Smaragdi (Vihre&auml; jalokivi)</TD><TD>3</TD><TD>Pelaaja saa &pound;500.</TD></TR>
<TR><TD>Rubiini (Punainen jalokivi)</TD><TD>2</TD><TD>Pelaaja saa &pound;1000.</TD></TR>
<TR><TD>Afrikan t&auml;hti (Iso timantti)</TD><TD>1</TD><TD>Pelaaja voi nyt palata jompaan<BR>kumpaan aloituspisteeseen voittaakseen.</TD></TR>
</TABLE>

<H2>5. Erikoisia paikkoja</H2>
<P>Seuraavilla paikoilla on erityinen merkitys:</P>
<UL>
<LI><B>Gold Coast</B> - T&auml;&auml;lt&auml; l&ouml;ydetyt jalokivet ovat kaksi kertaa niin
arvokkaita kuin normaalisti.
<LI><B>Slave Coast</B> - Pelaaja joka nostaa tyhj&auml;n pelimerkin t&auml;&auml;ll&auml; j&auml;&auml;
orjaksi, eik&auml; pysty tekem&auml;&auml;n mit&auml;&auml;n 3:n vuoron ajan.
<LI><B>Capetown</B> - Ensimm&auml;inen pelaaja joka saapuu t&auml;nne saa &pound;500
 bonuksen.
<LI><B>St. Helena</B> - Ruudut saaren molemmilla puolilla (merkattu tummilla
ympyr&ouml;ill&auml;) ovat merirosvojen hallitsemia vesi&auml;. Pelaaja joka saapuu t&auml;nne
j&auml;&auml; vangiksi kunnes onnistuu heitt&auml;m&auml;&auml;n 1 tai 2.
<LI><B>Saharan autiomaa</B> - Ruutu 2 askelta Saharasta it&auml;&auml;n (merkattu tummalla
ympyr&auml;ll&auml;) on vihamielisten beduiinien koti. Pelaaja joka saapuu t&auml;nne j&auml;&auml;
vangiksi kunnes onnistuu heitt&auml;m&auml;&auml;n 1 tai 2.
</UL>

<H2>6. Voittoon kykenem&auml;t&ouml;n pelaaja</H2>
<P>Pelaaja jolla ei ole en&auml;&auml; edes teoreettista mahdollisuutta voittaa poistetaan
pelist&auml;. H&auml;nen pelinappulansa j&auml;&auml; siihen miss&auml; se olikin, mutta h&auml;nen
statuksensa kirjataan jumittuneeksi, eik&auml; h&auml;nelle en&auml;&auml; anneta pelivuoroa. T&auml;m&auml;
tapahtuu jos jokin seuraavista tilanteista p&auml;tee:</P>
<UL>
<LI>Pelaaja j&auml;&auml; jumiin saarelle vailla keinoa poistua sielt&auml;. (Klassinen tapa
j&auml;&auml;d&auml; jumiin on nostaa rosvo St. Helenasta.)
<LI>Pelaaja &quot;j&auml;&auml; jumiin&quot; mantereelle ilman rahaa, kun kaikki j&auml;ljell&auml;
olevat pelimerkit ovat saarilla. Kyseisell&auml; pelaajalla ei ole hallussaan
Afrikan t&auml;hte&auml;, tai korvikkeeksi kelpaavaa hevosenkenk&auml;&auml;.
<LI>Afrikan t&auml;hti sek&auml; kaikki 5 hevosenken&auml;&auml; on jo l&ouml;ydetty. Kyseisell&auml;
pelaajalla ei ole Afrikan t&auml;hte&auml;, tai korvikkeeksi kelpaavaa hevosenkenk&auml;&auml;.
</UL>
<P>Mik&auml;li kaikki pelaajat joutuvat tilanteeseen miss&auml; eiv&auml;t kykene voittamaan,
peli julistetaan p&auml;&auml;ttyneeksi ilman voittajaa.</P>

<H2>7. Voittaminen</H2>
<P>Ensimm&auml;inen pelaaja joka kuljettaa Afrikan t&auml;hden, tai Afrikan t&auml;hden
l&ouml;ytymisen <I>j&auml;lkeen</I> l&ouml;ydetty hevosenkenk&auml;, jompaan kumpaan
aloituspisteeseen (Tangier tai Cairo) on voittaja.</P>
<UL>
<LI>Ei ole pakko palata samaan paikkaan kuin mist&auml; l&auml;hti. Kumpi tahansa kelpaa.
<LI>Aivan kuten kaupunkien kanssa, <I>ei</I> ole pakko tulla maaliin
tasasilm&auml;luvulla, vaan suurempikin silm&auml;lukum&auml;&auml;r&auml; kelpaa.
<LI>On vain yksi voittaja. Lopettaminen &quot;saman vuoron aikana&quot;
voittajan kannsa, ei lasketa tasapeliksi.
<LI>Jos kaikki hevosenkeng&auml;t on jo l&ouml;ydetty kun Afrikan t&auml;hti l&ouml;ytyy eik&auml;
l&ouml;yt&auml;j&auml; itse ole jumissa, h&auml;net julistetaan automaattisesti voittajaksi.
<LI>Rosvot varastavat vain pelaajan rahat, ei Afrikan t&auml;hte&auml; tai
hevosenkenk&auml;korvikkeita.
</BODY>
</HTML>
