<HTML>
<HEAD>
<TITLE>Afrikas stj&auml;rna - Regler</TITLE>
</HEAD>
<BODY BACKGROUND="/star_of_Africa/docs/background.png">
<CENTER><H1>Spelregler</H1></CENTER>

<H2>1. F&ouml;rord</H2>
<P>Detta spel &auml;r en datoranpassning av det finska br&auml;dspelet &quot;Afrikas
 stj&auml;rna&quot; ursprungligen skapat av Kari Mannerla. I Sverige &auml;r spelet
 &auml;ven k&auml;nt under namnet &quot;Den f&ouml;rsvunna diamanten&quot;. Reglerna som
 f&ouml;ljde med originalet var korta och simpla - s&aring; simpla att de inte alltid
 var entydiga. T.ex. tog de inte st&auml;llning till huruvida en spelare &auml;r
 till&aring;ten att forts&auml;tta direkt fr&aring;n en sj&ouml;rutt till en landrutt med samma
 kast. F&ouml;ljdaktligen har spelet spelats med or&auml;kneliga sm&aring; variationer under
 decenniernas g&aring;ng, s&aring; att spelarna alltid kom &ouml;verens om detaljerna i
 regelverket innan spelets b&ouml;rjan. En dylik brist p&aring; exakthet &auml;r givetvis
 inte acceptabel f&ouml;r ett dataspel, och d&auml;rf&ouml;r uppmanas spelaren g&auml;rna att
 bekanta sig med <I>dessa</I> regler, &auml;ven om han vore bekant med spelet
 sedan tidigare.</P>

<P>Det b&ouml;r &auml;ven noteras att &aring;r 2005 ut&ouml;kades officiellt de ursprungliga
 reglerna, med en regel som s&auml;ger att en luspank spelare trots allt f&aring;r
 begagna sig av sj&ouml;rutter, s&aring;lunda att han f&aring;r flytta 2 steg i taget utan
 att kasta t&auml;rning. Detta spel f&ouml;ljer trots det originalreglerna, enligt
 vilka detta inte &auml;r till&aring;tet. En framtida version av spelet kommer kanske
 att inneh&aring;lla en valm&ouml;jlighet mellan reglerna, men tills vidare &auml;r det de
 gamla reglerna som g&auml;ller.</P>

<H2>2. Det allm&auml;nna scenariot</H2>
<P>Afrikas stj&auml;rna &auml;r ett br&auml;dspel f&ouml;r 2-5 spelare, varav minst en m&aring;ste vara
 m&auml;nniska. De &ouml;vriga kan antingen spelas av m&auml;nniskor, eller datorspelare.
 Spelet anses vara l&auml;mpligt f&ouml;r 4-&aring;ringar och upp&aring;t.</P>
<P>Br&auml;det best&aring;r av en karta
 f&ouml;rest&auml;llande Afrika, med rutter som f&ouml;renar de olika platserna land-, sj&ouml;-,
 och luft-v&auml;gen. Det finns 30 st&auml;llen (st&auml;der) p&aring; kartan som i spelets b&ouml;rjan
 har spelbrickor p&aring; sig. Dessa kan spelarna plocka upp. Innan spelets b&ouml;rjan blandas brickorna om, och placeras
slumpm&auml;ssigt ut p&aring; st&auml;derna med bildsidan ned&aring;t, en p&aring; var stad. (Datorn sk&ouml;ter
automatiskt om detta.)</P>

<P>Innan spelet kan b&ouml;rja, m&aring;ste spelarna avg&ouml;ra om de vill starta i Tangier eller Cairo (utm&auml;rkta med stora r&ouml;da
 cirklar p&aring; br&auml;det). Spelets m&aring;l &auml;r att hitta brickan med Afrikas stj&auml;rna, och s&aring; fort som m&ouml;jligt
 &aring;terv&auml;nda med denna till n&aring;gondera startpunkten. I originalversionen avgjorde
 spelarna startordningen med t&auml;rningskast, i den h&auml;r versionen lottar datorn
 automatiskt ut startordningen.</P>

<H2>3. F&ouml;rflyttning</H2>
<H3>3.1. Att flytta landv&auml;gen</H3>
<P>En spelare kan f&ouml;rflytta sig landv&auml;gen genom att sl&aring; t&auml;rning, och flytta det
 antal steg som t&auml;rningskastet p&aring;bjuder. Skulle spelaren p&aring; v&auml;gen st&ouml;ta p&aring; en
 stad f&aring;r han, om han s&aring; vill, stanna d&auml;r, &auml;ven om han tagit f&auml;rre steg &auml;n
 t&auml;rningen indikerar.</P>

<H3>3.2. Att flytta sj&ouml;v&auml;gen</H3>
<P>En spelare f&aring;r f&ouml;rflytta sig sj&ouml;v&auml;gen genom att betala 100 pund f&ouml;r
 biljetten, vars pris &auml;r detsamma oberoende av sj&ouml;ruttens l&auml;ngd. Sedan f&aring;r
 han kasta t&auml;rningen och f&ouml;rflytta sig l&auml;ngs de bl&aring; sj&ouml;rutorna det antal steg
 som t&auml;rningen p&aring;bjuder. Efter att ha stigit ombord p&aring; fartyget &auml;r han p&aring;
 v&auml;g till den destination som han angav, och kan inte &auml;ndra p&aring; sitt m&aring;l, &auml;ven
 om rutten p&aring; kartan delar sig p&aring; ett s&aring;dant s&auml;tt att en kurs&auml;ndring vore
 m&ouml;jlig p&aring; land. (Han &auml;r trots allt bara en passagerare p&aring; ett fartyg som inte
 &auml;ndrar sin rutt bara f&ouml;r att en passagerare kommit p&aring; andra tankar.)</P>

 <P><b>UPDATE 2014:</b> The current rules allow boarding a ship, and advancing up to two steps per turn without payment. You may not decide to pay the fare after boarding in order to speed up the trip. </P>

<P>B&aring;de ombordstigningen och landstigningen tar sin tid, och en spelare kan
 d&auml;rf&ouml;r inte anv&auml;nda &quot;&ouml;verlopps&quot; t&auml;rnings&ouml;gon till att passera, vare
 sig sj&ouml;ruttens b&ouml;rjan eller slut p&aring; en tur.</P>

<H3>3.3. Att flytta luftv&auml;gen</H3>
<P>En spelare kan f&ouml;rflytta sig l&auml;ngs flygrutterna (r&ouml;da linjer som f&ouml;renar tv&aring;
 st&auml;der) genom att betala flygbiljetten p&aring; 300 pund, och flytta sin spelpj&auml;s
 raka v&auml;gen till destinationen utan att kasta t&auml;rning. Precis som med
 b&aring;tbiljetten, &auml;r priset detsamma oavsett str&auml;ckan.</P>

<H2>4. Brickorna</H2>
<H3>4.1. Att &ouml;ppna en bricka</H3>
<P>En spelare kan &ouml;ppna en bricka han st&aring;r p&aring; antingen genom att betala 100 pund
eller - om han &auml;r pank, eller av n&aring;gon anledning ovillig att spendera pengar -
genom att kasta t&auml;rning, och sl&aring; en fyra eller h&ouml;gre. Ett kast som spenderats
p&aring; att &ouml;ppna en bricka kan inte anv&auml;ndas f&ouml;r f&ouml;rflyttning av spelpj&auml;sen, oavsett
om f&ouml;rs&ouml;ket lyckats eller ej. P.g.a. detta m&aring;ste alltid avsikten att kasta f&ouml;r
v&auml;ndandet av bricka signaleras innan kastet utf&ouml;rs.</P>
<P>Spelaren kan k&ouml;pa brickan s&aring; fort han anl&auml;nder till den, f&ouml;rutsatt att han
har tillr&auml;ckliga tillg&aring;ngar. Skulle han vela &ouml;ppna brickan medelst t&auml;rningskast,
m&aring;ste han v&auml;nta till n&auml;sta tur.</P>

<H3>4.2. Olika sorters brickor</H3>
<P>Det finns 7 olika sorters brickor, som alla har sin egen betydelse:</P>
<TABLE BORDER="1">
<TR><TD><B>Bricka</B></TD><TD><B>Antal brickor</B></TD><TD><B>Verkan</B></TD></TR>
<TR><TD>Blank</TD><TD>12</TD><TD>Inget h&auml;nder.</TD></TR>
<TR><TD>H&auml;stsko</TD><TD>5</TD><TD>F&ouml;re stj&auml;rnan hittats h&auml;nder<BR>ingenting. Efter uppt&auml;ckten tj&auml;nar<BR>den som en ers&auml;ttare f&ouml;r stj&auml;rnan.</TD></TR>
<TR><TD>R&ouml;vare</TD><TD>3</TD><TD>Spelaren f&ouml;rlorar alla sina pengar.</TD></TR>
<TR><TD>Topas (Gul &auml;delsten)</TD><TD>4</TD><TD>Spelaren f&aring;r &pound;300.</TD></TR>
<TR><TD>Smaragd (Gr&ouml;n &auml;delsten)</TD><TD>3</TD><TD>Spelaren f&aring;r &pound;500.</TD></TR>
<TR><TD>Rubin (R&ouml;d &auml;delsten)</TD><TD>2</TD><TD>Spelaren f&aring;r &pound;1000.</TD></TR>
<TR><TD>Afrikas stj&auml;rna (Stor diamant)</TD><TD>1</TD><TD>Spelaren kan nu snabbast m&ouml;jligt<BR>ta sig till en startpunkt f&ouml;r att vinna.</TD></TR>
</TABLE>

<H2>5. Speciella platser</H2>
<P>F&ouml;ljande platser har en speciell betydelse:</P>
<UL>
<LI><B>Gold Coast</B> - &Auml;delstenar som hittas h&auml;r, &auml;r v&auml;rda dubbelt s&aring;
mycket som normalt.
<LI><B>Slave Coast</B> - En spelare som lyfter en blank bricka h&auml;r, blir
f&ouml;rslavad och kan inte g&ouml;ra n&aring;got p&aring; 3 turer.
<LI><B>Capetown</B> - Den f&ouml;rste spelaren som kommer hit f&aring;r en bonus p&aring; &pound;500.
<LI><B>St. Helena</B> - Platserna p&aring; &ouml;ns b&auml;gge sidor (markerade med m&ouml;rka
cirklar) &auml;r sj&ouml;r&ouml;varfarvatten, och en spelare som hamnar p&aring; n&aring;gon av dem blir
tillf&aring;ngatagen tills han lyckas kasta en 1:a eller en 2:a.
<LI><B>Sahara&ouml;knen</B> - Platsen 2 steg &ouml;ster om Sahara (m&auml;rkt med en m&ouml;rk
cirkel) &auml;r hemvist f&ouml;r fientligt sinnade beduiner. En spelare som hamnar h&auml;r
blir tillf&aring;ngatagen tills han lyckas sl&aring; en 1:a eller en 2:a.
</UL>

<H2>6. Spelare utan m&ouml;jlighet att vinna</H2>
<P>En spelare som inte ens har en teoretisk chans att vinna spelet avl&auml;gsnas
automatisk fr&aring;n spelet. Hans spelpj&auml;s l&auml;mnas d&auml;r den &auml;r, men hans status kommer
att visas som &quot;STRANDSATT&quot;, och han kommer att bli &ouml;verhoppad d&aring;
turen kommer till honom. Detta h&auml;nder om n&aring;got av f&ouml;ljande scenarion intr&auml;ffar:</P>

<UL>
<LI>Spelaren blir strandsatt p&aring; en &ouml; utan m&ouml;jlighet att ta sig d&auml;rifr&aring;n. (Det
klassiska s&auml;ttet att bli strandsatt &auml;r att dra en r&ouml;vare p&aring; St. Helena.)
<LI>Spelaren blir &quot;strandsatt&quot; p&aring; fastlandet utan pengar, medan alla
kvarvarande brickor befinner sig p&aring; &ouml;ar. Spelaren i fr&aring;ga har varken Afrikas
stj&auml;rna, eller n&aring;gon giltig ers&auml;ttning (h&auml;stsko).
<LI>Afrikas st&auml;rna har hittats. Samma sak g&auml;ller alla 5 h&auml;stskorna. Spelaren i
fr&aring;ga &auml;r inte den som hittat stj&auml;rnan, och han har inte heller n&aring;gon giltig
ers&auml;ttning.
</UL>
<P>Om alla spelare skulle bli of&ouml;rm&ouml;gna att vinna, kommer spelet att f&ouml;rklaras
oavgjort.</P>

<H2>7. Att vinna</H2>
<P>Den f&ouml;rste spelaren som transporterar antingen Afrikas stj&auml;rna, eller en
h&auml;stsko som upphittats <I>efter</I> uppt&auml;ckten av stj&auml;rnan, till n&aring;gondera
startpunkten (Tangier eller Cairo) har vunnit.</P>
<UL>
<LI>Spelaren beh&ouml;ver inte n&ouml;dv&auml;ndigtvis &aring;terv&auml;nda till samma st&auml;lle som han startade ifr&aring;n.
B&aring;da startplatserna duger som m&aring;l.
<LI>Liksom &auml;r fallet med st&auml;derna, s&aring; kr&auml;vs det <I>inte</I> att spelaren sl&aring;r
exakt det &ouml;gontal som han har steg kvar till m&aring;let. Att sl&aring; det antalet, eller
h&ouml;gre r&auml;cker.
<LI>Det finns bara en segrare. Att avsluta &quot;p&aring; samma tur&quot; som segraren
r&auml;knas inte som j&auml;mnt spel.
<LI>Om alla h&auml;stskor redan putsats fr&aring;n br&auml;det d&aring; Afrikas stj&auml;rna upphittas,
kommer upphittaren automatiskt att utropas segrare, f&ouml;rutsatt att han inte sj&auml;lv
&auml;r strandsatt.
<LI>R&ouml;varna stj&auml;l endast spelarnas pengar. De l&auml;gger inte vantarna p&aring; stj&auml;rnan,
eller p&aring; de h&auml;stskor som utg&ouml;r ers&auml;ttare f&ouml;r den.
</BODY>
</HTML>
